
## Plan Result (ecs_practice/terraform)

[CI link](https://github.com/harayu-k/infra_sandbox/actions/runs/12973327638)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_vpc_security_group_ingress_rule.frontend
  * aws_vpc_security_group_ingress_rule.ingress


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_vpc_security_group_ingress_rule.frontend will be created
  + resource "aws_vpc_security_group_ingress_rule" "frontend" {
      + arn                          = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = "sg-0e4473224aa390b41"
      + security_group_id            = "sg-052cb2af249584e81"
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {
          + "Managed" = "Terraform"
        }
    }

  # aws_vpc_security_group_ingress_rule.ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "ingress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = "sg-0e4473224aa390b41"
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "Managed" = "Terraform"
        }
      + to_port                = 80
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":39,"Program":"tfcmt","SHA1":"1c2b460be76776e278e407e481aa0d31d0c16beb","Target":"ecs_practice/terraform","Vars":{},"WorkflowName":"terraform-plan"} -->